app/views/users/show_profile.html.erb

<% else %>
 <p><%= link_to "Create Profile", :action => "new_profile", :controller => "users" if current_user.present? %></p>
---
SELECT `profiles`.* FROM `profiles` WHERE (`profiles`.user_id = 1) LIMIT 1